In [1]:
import numpy as np
import pandas as pd

In [3]:
sozlukVerisi = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "İzmir": [30,32,34]}
havadurumu_df = pd.DataFrame(sozlukVerisi)

In [5]:
havadurumu_df

   Istanbul  Ankara  İzmir
0      30.0    20.0     30
1      29.0     NaN     32
2       NaN    25.0     34

In [6]:
havadurumu_df.dropna() #nan olan satırları çıkarıyor

   Istanbul  Ankara  İzmir
0      30.0    20.0     30

In [8]:
havadurumu_df.dropna(axis = 1) #nan olayan tek kolonu karşımıza getirdi

   İzmir
0     30
1     32
2     34

In [15]:
yeniVeri = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "İzmir": [30,32,34],"Adana": [np.nan,42,np.nan]}
yeni_df = pd.DataFrame(yeniVeri)

In [16]:
yeni_df

   Istanbul  Ankara  İzmir  Adana
0      30.0    20.0     30    NaN
1      29.0     NaN     32   42.0
2       NaN    25.0     34    NaN

In [17]:
yeni_df.dropna(axis = 1, thresh = 2) #thresh = 2 dediğimde 2 nan olan kolonları atıyor diğerleri kalıyor

   Istanbul  Ankara  İzmir
0      30.0    20.0     30
1      29.0     NaN     32
2       NaN    25.0     34

In [18]:
yeni_df

   Istanbul  Ankara  İzmir  Adana
0      30.0    20.0     30    NaN
1      29.0     NaN     32   42.0
2       NaN    25.0     34    NaN

In [22]:
yeni_df.fillna(20) #boş olan kısımlara 20 bastı

   Istanbul  Ankara  İzmir  Adana
0      30.0    20.0     30   20.0
1      29.0    20.0     32   42.0
2      20.0    25.0     34   20.0

In [24]:
#Gruplandırmak(GROUP BY)

In [28]:
maasdict = {"departman": ["yazılım", "yazılım", "pazarlama","pazarlama","hukuk","hukuk"],
           "calisan ismi": ["ahmet", "mehmet", "atıl","burak","ipek","fatma"],
           "maas": [100,150,200,300,400,500]}

In [29]:
maas_df = pd.DataFrame(maasdict)
maas_df

   departman calisan ismi  maas
0    yazılım        ahmet   100
1    yazılım       mehmet   150
2  pazarlama         atıl   200
3  pazarlama        burak   300
4      hukuk         ipek   400
5      hukuk        fatma   500

In [30]:
maas_df.groupby("departman")

In [32]:
grupObjesi = maas_df.groupby("departman")

In [33]:
grupObjesi.count()

           calisan ismi  maas
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [34]:
grupObjesi.mean()

           maas
departman
hukuk       450
pazarlama   250
yazılım     125

In [36]:
grupObjesi.max()

          calisan ismi  maas
departman
hukuk             ipek   500
pazarlama        burak   300
yazılım         mehmet   150

In [37]:
grupObjesi.min()

          calisan ismi  maas
departman
hukuk            fatma   400
pazarlama         atıl   200
yazılım          ahmet   100

In [40]:
grupObjesi.describe() #betimsel istatistik

           maas
          count   mean        std    min    25%    50%    75%    max
departman
hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0